## Central account
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 3 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                     NAME                                     |
|--------|------------------------------------------------------------------------------|
| add    | `module.gh_oidc_roles.aws_iam_role.this[&quot;ConfigTerraformAdministratorRole&quot;]` |
|        | `module.log_archive_access_bucket.aws_s3_bucket_acl.this`                    |
|        | `module.log_archive_access_bucket.aws_s3_bucket_ownership_controls.this`     |
|        | `module.log_archive_access_bucket.aws_s3_bucket_versioning.this`             |
| delete | `module.gh_oidc_roles.aws_iam_role.this[0]`                                  |
| update | `module.log_archive_access_bucket.aws_s3_bucket.this`                        |
|        | `module.log_archive_access_bucket.aws_s3_bucket_policy.this`                 |
|        | `module.log_archive_bucket.aws_s3_bucket.this`                               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.gh_oidc_roles.aws_iam_role.this[0] will be destroyed
  # (because resource does not use count)
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::871282759583:role/ConfigTerraformAdministratorRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - token.actions.githubusercontent.com:sub = [
                                  - "repo:cds-snc/cloud-based-sensor:*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::871282759583:oidc-provider/token.actions.githubusercontent.com"
                        }
                      - Sid       = ""
                    },
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = [
                              - "arn:aws:iam::957818836222:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::866996500832:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::843973686572:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::806721586252:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::806545929748:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::796730610681:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::794722365809:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::762579868088:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::729164266357:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::687401027353:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::637287734259:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::521732289257:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::472286471787:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::414662622316:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::307395567143:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::296255494825:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::283582579564:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::239043911459:role/ConfigTerraformAdminExecutionRole",
                              - "arn:aws:iam::127893201980:role/ConfigTerraformAdminExecutionRole",
                            ]
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-01-27T20:51:10Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ConfigTerraformAdministratorRole" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AdministratorAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ConfigTerraformAdministratorRole" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = "2023-07-11T14:02:40Z"
              - region         = "us-east-1"
            },
        ] -> null
      - tags                  = {
          - "CostCentre" = "cbs-871282759583"
          - "Terraform"  = "true"
        } -> null
      - tags_all              = {
          - "CostCentre" = "cbs-871282759583"
          - "Terraform"  = "true"
        } -> null
      - unique_id             = "AROA4VXD726PQKTOQQPXG" -> null

      - inline_policy {}
    }

  # module.gh_oidc_roles.aws_iam_role.this["ConfigTerraformAdministratorRole"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + token.actions.githubusercontent.com:sub = [
                                  + "repo:cds-snc/cloud-based-sensor:*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::871282759583:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::957818836222:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::866996500832:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::843973686572:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::806721586252:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::806545929748:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::796730610681:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::794722365809:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::762579868088:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::729164266357:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::687401027353:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::637287734259:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::521732289257:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::472286471787:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::414662622316:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::307395567143:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::296255494825:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::283582579564:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::239043911459:role/ConfigTerraformAdminExecutionRole",
                              + "arn:aws:iam::127893201980:role/ConfigTerraformAdminExecutionRole",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ConfigTerraformAdministratorRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "CostCentre" = "cbs-871282759583"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cbs-871282759583"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.log_archive_access_bucket.data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined"  {
      ~ id                      = "1075183136" -> (known after apply)
      ~ json                    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = [
                                  - "false",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::cbs-log-archive-871282759583-access/*",
                          - "arn:aws:s3:::cbs-log-archive-871282759583-access",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ source_policy_documents = [
          - jsonencode(
                {
                  - Statement = [
                      - {
                          - Action    = "s3:*"
                          - Condition = {
                              - Bool = {
                                  - aws:SecureTransport = "false"
                                }
                            }
                          - Effect    = "Deny"
                          - Principal = "*"
                          - Resource  = [
                              - "arn:aws:s3:::cbs-log-archive-871282759583-access/*",
                              - "arn:aws:s3:::cbs-log-archive-871282759583-access",
                            ]
                          - Sid       = "denyInsecureTransport"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ),
        ] -> (known after apply)
      - version                 = "2012-10-17" -> null
    }

  # module.log_archive_access_bucket.data.aws_iam_policy_document.deny_insecure_transport will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deny_insecure_transport"  {
      ~ id      = "3636405323" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::cbs-log-archive-871282759583-access/*",
                          - "arn:aws:s3:::cbs-log-archive-871282759583-access",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }
    }

  # module.log_archive_access_bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "cbs-log-archive-871282759583-access"
      ~ tags                        = {
          + "Critical"   = "true"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                    = {
          + "Critical"   = "true"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # module.log_archive_access_bucket.aws_s3_bucket_acl.this will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "log-delivery-write"
      + bucket = "cbs-log-archive-871282759583-access"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.log_archive_access_bucket.aws_s3_bucket_ownership_controls.this will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = "cbs-log-archive-871282759583-access"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.log_archive_access_bucket.aws_s3_bucket_policy.this will be updated in-place
  ~ resource "aws_s3_bucket_policy" "this" {
        id     = "cbs-log-archive-871282759583-access"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = [
                                  - "false",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::cbs-log-archive-871282759583-access/*",
                          - "arn:aws:s3:::cbs-log-archive-871282759583-access",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.log_archive_access_bucket.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = "cbs-log-archive-871282759583-access"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Disabled"
        }
    }

  # module.log_archive_bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "cbs-log-archive-871282759583"
      ~ tags                        = {
          + "Critical"   = "false"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                    = {
          + "Critical"   = "false"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)




      ~ server_side_encryption_configuration {
          ~ rule {
              ~ bucket_key_enabled = false -> true

                # (1 unchanged block hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 4 to add, 3 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.log_archive_access_bucket.aws_s3_bucket.this,
  on .terraform/modules/log_archive_access_bucket/S3_log_bucket/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 7 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.log_archive_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.log_archive_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.log_archive_encrypt"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.log_archive"]

21 tests, 17 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
